'use client'
import React, { useState } from 'react'
import styles from '@/styles/Home.module.css'
import RuleModal from '@/components/RuleModal'

const rules = [
    {
        title: 'ПУБЛІЧНІ ПРАВИЛА ПЕРЕБУВАННЯ ДІТЕЙ В ІГРОВИХ КІМНАТАХ',
        shortDescription:
            'Батьки відповідають за нагляд за дітьми; дотримуйтесь інструкцій персоналу.',
        fullDescription: [
            "Батьки (законні представники) мають ознайомитись з правилами перебування дітей в ігровій кімнаті, якщо не згодні з деякими пунктами правил краще відмовитись від послуг.",
            "До ігрової кімнати «Жирафик» допускаються люди різного віку, без явних ознак респіраторних та інших хвороб, що передаються повітряно-крапельним або іншим контактним шляхом. Адміністрація має право відмовити в послузі на свій розсуд. Діти від 0 — 4-х років, залишаються тільки з одним із батьків (законним представником)",
            "Щоби забезпечити безпеку кожної дитини, одночасно до ігрової кімнати може бути прийнято не більше 25 осіб.",
            "Обов’язковою умовою пропуску дитини до ігрової дитячої кімнати є заповнення одним із батьків (законним представником) реєстраційної форми, в якій відмічається час прибуття/вибуття дитини до/з ігрової кімнати, контактний телефон батьків (законних представників), за яким у випадку необхідності з ними можна зв’язатися, а також інша необхідна інформація про дитину та батьків (законних представників).",
            "Перед відвідуванням ігрової кімнати батькам необхідно відвести дитину до туалетної кімнати. Батьки зобовʼязані контролювати та не допускати справляння дітьми природніх потреб в ігрових кімнатах. Якщо таке трапляється негайно повідомити персонал.",
            "Залишаючи дитину в ігровій кімнаті, батьки повинні зняти з дитини верхній одяг, взуття та прикраси. Відвести дитину до туалетної кімнати. Дитина має знати та вміти ходити до туалету самостійно! Повідомте адміністратору особливості характеру вашої дитини та її інтереси.",
            "Привівши дитину вперше, (або якщо Ви у нас не були більше 6 місяців) не залишайте її надовго, щоби допомогти адаптуватись до нового середовища та людей.",
            "Для підтримання чистоти та гігієни, в ігрову кімнату допускаються діти тільки в змінному взутті або шкарпетках та одягнені відповідно до температурного режиму у приміщені ігрової кімнати з врахуванням активної гри дітей. Діти 0-4 років в підгузках.",
            "До ігрової кімнати дітям забороняється приносити колючо-ріжучі та інші предмети, які здатні завдати травми; ручну поклажу, їжу, напої, іграшки, гроші, документи та цінні речі.",
            "Будь ласка, поясніть дитині, що в ігровій кімнаті забороняється штовхати один одного, кидатися предметами, іграшками і застосовувати фізичну силу для вирішення будь-якого питання; розмовляти з вживанням непристойних слів і жестів на адресу будь-кого;  заважати відпочивати іншим дітям.",
            "Дітям забороняється залишати ігрову кімнату без супроводу представника Адміністрації або батьків (законних представників).",
            "Рекомендований час перебування в ігровій кімнаті – не більше 4-х годин для дітей молодшого шкільного віку, 1 год — від 3 років, 30 хв — діти до 3 -х років",
            "Адміністрація не несе відповідальності за шкоду, пов’язані з погіршенням здоров'я відвідувача, якщо воно сталося у зв’язку з його гострим, хронічним або психологічним захворюванням. Батьки несуть повну відповідальність за поведінку своїх дітей та у разі травмування себе або іншої дитини.  Адміністрація закладу жодної відповідальності не несе.",
            "Забороняється виносити з території ігрової кімнати іграшки, інвентар та ігрове обладнання.",
            "У разі прояву агресії або іншої специфічної поведінки Адміністрація залишає за собою право припинення перебування дитини в ігровій кімнаті та достроковому виклику батьків (законних представників).",
            "Забрати дитину з ігрової кімнати мають право особи, вказані у реєстраційній формі, пред’явивши документ, що засвідчує особу, та реєстраційну форму.",
            "Якщо після закінчення часу роботи ігрової кімнати батьки (законні представники) не забрали дитину з ігрової кімнати, Адміністрація вправі звернутися до поліції для здійснення розшуку батьків.",
            "За умисні противоправні дії, а також за умисне пошкодження майна ігрової кімнати, заподіяння шкоди життю та здоров’ю третіх осіб, вчинені дитиною або його батьками (законними представниками), батьки (законні представники) несуть повну відповідальність згідно чинного законодавства, в тому числі майнову відповідальність по відшкодуванню завданої третім особам майнової шкоди, а також шкоди, завданої життю та здоров’ю третіх осіб.",
            "Не допускаються в ігрову кімнату відвідувачі у алкогольному, наркотичному чи психологічно нестабільному стані.",
            "Вживання алкогольних напоїв, паління на всій території розважального комплексу категорично заборонено. Заборона поширюється на всі види тютюнових виробів і електронні аналоги.",
            "Персонал має право не допустити в ігрову осіб, які викликають певну підозру.",
            "Персонал має право зупинити ігровий процес відвідувача, що не дотримується правил поведінки.",
            "Вхід для дорослих безкоштовний. Плата за вхід для дітей встановлена згідно з тарифами центру.",
            "У центрі ЖИРАФИК дозволено фотографувати та здійснювати відеозйомку. Батьки, які знаходяться з дитиною дають згоду на фотографування себе і дитини іншими відвідувачами та фотографами центру, а також дають згоду на розташування фото на сайті та у соціальних мережах закладу.",
            "За втрачені або залишені без нагляду речі Адміністрація відповідальності не несе.",
            "Адміністрація закладу залишає за собою право змінювати та доповнювати правила СРЦ ЖИРАФИК в односторонньому порядку без будь-якого спеціального повідомлення. Ми рекомендуємо нашим відвідувачам регулярно перевіряти ці правила на предмет їх зміни та доповнення."
        ],
    },
    {
        title: 'Рекомендовані Правила поведінки в лабіринті та на батуті',
        shortDescription:
            'Батьки (законні представники) повинні самі визначати для своєї дитини ступінь безпеки  знаходження на батуті та ігрових комплексах',
        fullDescription: [
            "Ігровий комплекс розрахований для дітей від 3 до 12 років.",
            "Максимальна кількість відвідувачів в атракціоні лабіринт — 6 дітей",
            "Максимальне навантаження на батутне полотно — 110 кг.",
            "Максимальна кількість відвідувачів на батутному полотні — 2 дитини"
        ],
    },
    {
        title: 'Дбайливе ставлення',
        shortDescription:
            'Прохання дбайливо ставитись до інвентарю, ігрових зон та інших гостей.',
        fullDescription: [
            'Ми створили цей простір для радості та розвитку, тому просимо всіх гостей дбайливо ставитися до іграшок, обладнання та декорацій. У випадку пошкодження майна центру, батьки несуть матеріальну відповідальність. Давайте разом збережемо наш центр красивим та затишним!'
        ],
    },
    {
        title: 'Забороняється в ігрових комплексах',
        shortDescription:
            'Вживання їжі та напоїв дозволено лише у спеціально відведеній зоні кафе.',
        fullDescription: [
            "Заходити в верхньому одязі та вуличному взутті.",
            "Брати з собою їжу, напої, гострі або тверді предмети (іграшки, гаджети, окуляри та т.п)",
            "Спуск з гірки стоячи, сидячи на ногах, донизу головою, вдвох.",
            "Спуск з гірки дозволяється тільки якщо внизу біля гірки нікого немає.",
            "Залазити та висіти на огороджувальній сітці.",
            "Блокувати вхід-вихід в (з) лабіринт.",
            "Стрибати з висоти на батутне полотно.",
            "Стрибати з лабіринту униз.",
            "Різати, рвати, кусати кульки або паролонові кубики.",
            "Псувати атракціон.",
            "Штовхатися, битися, лаятись."
        ],
    },
    {
        title: 'Правила та умови перебування в кімнаті “GamePortal”',
        shortDescription:
            'Заборонено бігати, кричати та створювати незручності для інших відвідувачів.',
        fullDescription: [
            "Рекомендовано: PlayStation  призначена для осіб 7+. VR окуліри  призначені для осіб 8+. Крайнє не рекомендовано використання VR окулярів вагітними чи дітям до 8 років в силу специфіки високої емоційності та технічних особливостей наявного обладнання.",
            "Уважно слухати та ознайомитись з правилами перебування в GamePortal.",
            "Адміністратор має право відмовити в послузі.",
            "Не розбирати обладнання самостійно, щоб уникнути можливих пошкоджень.",
            "Не переключати ігри самостійно:  Для зміни ігор віртуальної реальності звернутись до адміністратора . Самостійне переключення може призвести до неправильного налаштування або конфлікту між різними користувачами.",
            "Заборонено грати в стані алкогольного чи наркотичного сп'яніння.",
            "Не переступай лінії на підлозі:  у окулярах віртуальної реальності відображені лінії на підлозі, не переступай їх без необхідності. Це може призвести до потенційних травм або перешкодити ігровому процесу інших користувачів.",
            "Не підходь близько та не заважай  до граючої людини в окулярах VR.",
            "В кімнаті GamePortal не кричати, не бігати.",
            "Ці правила спрямовані на забезпечення безпеки та належного використання обладнання в  GamePortal. Розумій, що додаткові правила або обмеження можуть бути встановлені на місці. Завжди слухай інструкції персоналу і виконуй поради адміністратора. Дотримуйся цих правил, щоб мати кращий досвід у віртуальному світі.",
            "За шкоду, заподіяну майну GamePortal, відвідувач несе матеріальну відповідальність. Зокрема, при пошкодженні обладнання (окулярів, геймпадів тощо) з вини відвідувача. У разі недотримання цих правил адміністрація не несе відповідальності."
        ],
    },
    {
        title: "Умови та правила послуги “Батьківський релакс”",
        shortDescription:
            'Заборонено відвідувати центр з ознаками ГРВІ чи інших інфекційних захворювань.',
        fullDescription: [
            "Батьки (законні представники) мають ознайомитись з публічними правилами перебування дітей в ігровій кімнаті, заповнити пам'ятку-розписку, якщо не згодні з деякими пунктами правил краще відмовитись від послуг.",
            "Вік дитини від 4 років.",
            "Батьки повинні зняти з дитини верхній одяг, взуття та прикраси. Відвести дитину до туалетної кімнати. Дитина має знати та вміти ходити до туалету самостійно! Повідомте адміністратору особливості характеру вашої дитини та її інтереси.",
            "Будь ласка, поясніть дитині, що в ігровій кімнаті забороняється штовхати один одного, кидатися предметами, іграшками і застосовувати фізичну силу для вирішення будь-якого питання; розмовляти з вживанням непристойних слів і жестів на адресу будь-кого; заважати відпочивати іншим дітям.",
            "Дітям забороняється залишати ігрову кімнату без супроводу представника Адміністрації або батьків (законних представників).",
            "Рекомендований час перебування в ігровій кімнаті з послугою “Батьківський релакс” – не більше 2-х годин .",
            "Протягом послуги ми створюємо для дитини легку, невимушену ігрову атмосферу для комфортного проведення часу .",
            "Дитина може гратись у двох залах, може користуватись ігровими, розвивальними, тренувальними матеріалами.",
            "Адміністрація не несе відповідальності за шкоду, пов’язані з погіршенням здоров'я відвідувача, якщо воно сталося у зв’язку з його гострим, хронічним або психологічним захворюванням. Батьки несуть повну відповідальність за поведінку своїх дітей та у разі травмування себе або іншої дитини.  Адміністрація закладу відповідальності не несе.",
            "У разі прояву агресії або іншої специфічної поведінки Адміністрація залишає за собою право припинення перебування дитини в ігровій кімнаті та достроковому виклику батьків (законних представників).",
            "Забрати дитину з ігрової кімнати мають право особи, вказані у реєстраційній формі, пред’явивши документ, що засвідчує особу, та реєстраційну форму."
        ],
    },
]

export default function RulesPage() {
  const [selectedRule, setSelectedRule] = useState<any>(null)

  const openModal = (rule: any) => {
    setSelectedRule(rule)
  }

  const closeModal = () => {
    setSelectedRule(null)
  }

  return (
    <div className={styles.container}>
      <section className={styles.aboutSection}>
        <div className={styles.containerInner}>
          <div className={styles.textCenter}>
            <h1 className={styles.sectionTitle}>Правила відвідування</h1>
            <p className={styles.sectionDescription}>
              Будь ласка, ознайомтесь з базовими правилами безпеки та поведінки у центрі «Жирафик».
            </p>
          </div>

          <div className={styles.featuresGrid}>
            {rules.map((rule, index) => (
              <div key={index} style={{cursor: 'pointer'}} className={styles.card} onClick={() => openModal(rule)}>
                <div className={styles.cardContent}>
                  <h3 className={styles.cardTitle}>{rule.title}</h3>
                  <p className={styles.cardDescription}>{rule.shortDescription}</p>
                </div>
              </div>
            ))}
          </div>
        </div>
      </section>

      {selectedRule && <RuleModal rule={selectedRule} onClose={closeModal} />}
    </div>
  )
}
